src/InformationRegisters/ИсторияИзмененияСтатусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИзмененияСтатусов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МинутПробылВИсходномСтатусе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходныйСтатус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонечныйСтатус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ГрафикРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ГрафикРаботы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РабочихЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/Команда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Команда</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Задачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Задачи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Оценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоНовая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БюджетыПУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатуЗавершенияУстановилАвтор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Версии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Релизы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Релизы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Релизы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРелиза</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РелизВыпущен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РелизСобран</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимаПередачаВФАП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БазыДляОбновления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаПодключения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ОбщегоНазначенияСерверПовтИсп/Ext/Module.bsl
Функция ПолучитьЭффективностиСотрудников() Экспорт 
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КомандаСостав.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ СоставКоманд
		|ИЗ
		|	Справочник.Команда.Состав КАК КомандаСостав
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команда КАК Команда
		|		ПО КомандаСостав.Ссылка = Команда.Ссылка
		|ГДЕ
		|	НЕ Команда.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИсторияИзмененияСтатусов.Автор КАК Сотрудник,
		|	Задачи.Оценка КАК Оценка,
		|	Задачи.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ДанныеЗадач
		|ИЗ
		|	РегистрСведений.ИсторияИзмененияСтатусов КАК ИсторияИзмененияСтатусов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СоставКоманд КАК СоставКоманд
		|		ПО ИсторияИзмененияСтатусов.Автор = СоставКоманд.Сотрудник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Задачи КАК Задачи
		|		ПО ИсторияИзмененияСтатусов.Задача = Задачи.Ссылка
		|ГДЕ
		|	ИсторияИзмененияСтатусов.ДатаСобытия МЕЖДУ &НачалоСобытия И &КонецСобытия
		|	И ИсторияИзмененияСтатусов.КонечныйСтатус В(&КонечныеСтатусы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеЗадач.Сотрудник КАК Сотрудник,
		|	СУММА(ДанныеЗадач.Оценка) КАК ОценкаОбщая,
		|	ВЫРАЗИТЬ(СУММА(ДанныеЗадач.Оценка) / КОЛИЧЕСТВО(*) КАК ЧИСЛО(10, 2)) КАК ОценкаСредняя,
		|	КОЛИЧЕСТВО(*) КАК Количество
		|ПОМЕСТИТЬ ДанныеЗадачГруппировкаПоСотруднику
		|ИЗ
		|	ДанныеЗадач КАК ДанныеЗадач
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеЗадач.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ДанныеЗадач.Оценка) КАК ОценкаОбщая,
		|	ВЫРАЗИТЬ(СУММА(ДанныеЗадач.Оценка) / КОЛИЧЕСТВО(*) КАК ЧИСЛО(10, 2)) КАК ОценкаСредняя,
		|	КОЛИЧЕСТВО(*) КАК Количество
		|ПОМЕСТИТЬ ДанныеЗадачГруппировка
		|ИЗ
		|	ДанныеЗадач КАК ДанныеЗадач
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеЗадач.Сотрудник КАК Сотрудник,
		|	МАКСИМУМ(ДанныеЗадачГруппировка.ОценкаОбщая) КАК ОценкаОбщая,
		|	МАКСИМУМ(ДанныеЗадачГруппировка.ОценкаСредняя) КАК ОценкаСредняя,
		|	СУММА(ВЫБОР
		|			КОГДА ДанныеЗадач.Оценка > ЕСТЬNULL(ДанныеЗадачГруппировка.ОценкаСредняя, 0)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КолВоЗадачВышеСреднего,
		|	МАКСИМУМ(ДанныеЗадачГруппировка.Количество) КАК Количество,
		|	ДанныеЗадачГруппировкаПоСотруднику.Количество КАК КоличествоПоСотруднику,
		|	(ВЫРАЗИТЬ(ДанныеЗадачГруппировкаПоСотруднику.Количество / МАКСИМУМ(ДанныеЗадачГруппировка.Количество) КАК ЧИСЛО(10, 2))) * 100 КАК ОтношениеКоличеств
		|ИЗ
		|	ДанныеЗадач КАК ДанныеЗадач
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеЗадачГруппировкаПоСотруднику КАК ДанныеЗадачГруппировкаПоСотруднику
		|		ПО ДанныеЗадач.Сотрудник = ДанныеЗадачГруппировкаПоСотруднику.Сотрудник,
		|	ДанныеЗадачГруппировка КАК ДанныеЗадачГруппировка
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеЗадач.Сотрудник,
		|	ДанныеЗадачГруппировкаПоСотруднику.Количество";
	
	Запрос.УстановитьПараметр("КонецСобытия", КонецКвартала(ТекущаяДатаСеанса()));    
	Запрос.УстановитьПараметр("НачалоСобытия", НачалоКвартала(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("КонечныеСтатусы", СтрРазделить("Закрыт,Сделан,Предоставлено ПР", ","));
	
	Ответ = Новый Соответствие();
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса.Колонки.Добавить("Эффективность");
	Для Каждого Стр Из РезультатЗапроса Цикл
		Стр.Эффективность = Стр.ОтношениеКоличеств * (Стр.КоличествоПоСотруднику / Стр.КолВоЗадачВышеСреднего);
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(*) КАК Количество,
	               |	ДанныеЗадач.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	ДанныеЗадач КАК ДанныеЗадач
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИзмененияСтатусов КАК ИсторияИзмененияСтатусов
	               |		ПО ДанныеЗадач.Ссылка = ИсторияИзмененияСтатусов.Задача
	               |ГДЕ
	               |	ИсторияИзмененияСтатусов.ДатаСобытия МЕЖДУ &НачалоСобытия И &КонецСобытия
	               |	И ИсторияИзмененияСтатусов.ИсходныйСтатус = &КонечныйСтатус
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДанныеЗадач.Сотрудник";
	
	Запрос.УстановитьПараметр("КонечныйСтатус", "Закрыт");
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр Из РезультатЗапроса Цикл
		КоличествоВозвратов = ТЗ.Скопировать(ТЗ.НайтиСтроки(Новый Структура("Сотрудник", Стр.Сотрудник))).Итог("Количество");
		Стр.Эффективность = Стр.Эффективность - КоличествоВозвратов;
	КонецЦикла;
	
	Возврат РезультатЗапроса;
КонецФункции

&НаСервере
Функция ПолучитьПроцентыЗагруженности() Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КомандаСостав.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ СоставКоманд
		|ИЗ
		|	Справочник.Команда.Состав КАК КомандаСостав
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команда КАК Команда
		|		ПО КомандаСостав.Ссылка = Команда.Ссылка
		|ГДЕ
		|	НЕ Команда.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Релизы.ДатаНачала КАК ДатаНачала,
		|	Релизы.ДатаРелиза КАК ДатаРелиза,
		|	СУММА(ГрафикРаботы.РабочихЧасов) КАК РабочихЧасов,
		|	ГрафикРаботы.Пользователь КАК Пользователь
		|ПОМЕСТИТЬ ЗагрузкаНаРелиз
		|ИЗ
		|	Справочник.Релизы КАК Релизы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикРаботы КАК ГрафикРаботы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СоставКоманд КАК СоставКоманд
		|			ПО ГрафикРаботы.Пользователь = СоставКоманд.Сотрудник
		|		ПО (НАЧАЛОПЕРИОДА(Релизы.ДатаНачала, ДЕНЬ) <= ГрафикРаботы.Дата)
		|			И (КОНЕЦПЕРИОДА(Релизы.ДатаРелиза, ДЕНЬ) >= ГрафикРаботы.Дата)
		|ГДЕ
		|	&ТекДата МЕЖДУ Релизы.ДатаНачала И Релизы.ДатаРелиза
		|
		|СГРУППИРОВАТЬ ПО
		|	Релизы.ДатаРелиза,
		|	Релизы.ДатаНачала,
		|	ГрафикРаботы.Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(СУММА(Задачи.Оценка) / МАКСИМУМ(ЗагрузкаНаРелиз.РабочихЧасов) * 100 КАК ЧИСЛО(10, 2)) КАК Процент,
		|	ЗагрузкаНаРелиз.Пользователь КАК Пользователь
		|ИЗ
		|	Справочник.Задачи КАК Задачи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗагрузкаНаРелиз КАК ЗагрузкаНаРелиз
		|		ПО Задачи.Исполнитель = ЗагрузкаНаРелиз.Пользователь
		|ГДЕ
		|	НЕ Задачи.Статус В (&СтатусыИсключения)
		|	И НЕ Задачи.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗагрузкаНаРелиз.Пользователь";
	
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("СтатусыИсключения", СтрРазделить("Закрыт,Сделан,Предоставлено ПР", ","));
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
КонецФункции
